jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/pac.h
#define PAC_INTFLAGB_SERCOM9_Pos              _UINT32_(0)                                          /* (PAC_INTFLAGB) SERCOM9 Position */
#define PAC_INTFLAGB_SERCOM9_Msk              (_UINT32_(0x1) << PAC_INTFLAGB_SERCOM9_Pos)          /* (PAC_INTFLAGB) SERCOM9 Mask */
#define PAC_INTFLAGB_SERCOM9(value)           (PAC_INTFLAGB_SERCOM9_Msk & (_UINT32_(value) << PAC_INTFLAGB_SERCOM9_Pos)) /* Assigment of value for SERCOM9 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TCC0_Pos                 _UINT32_(1)                                          /* (PAC_INTFLAGB) TCC0 Position */
#define PAC_INTFLAGB_TCC0_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TCC0_Pos)             /* (PAC_INTFLAGB) TCC0 Mask */
#define PAC_INTFLAGB_TCC0(value)              (PAC_INTFLAGB_TCC0_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC0_Pos)) /* Assigment of value for TCC0 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TCC1_Pos                 _UINT32_(2)                                          /* (PAC_INTFLAGB) TCC1 Position */
#define PAC_INTFLAGB_TCC1_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TCC1_Pos)             /* (PAC_INTFLAGB) TCC1 Mask */
#define PAC_INTFLAGB_TCC1(value)              (PAC_INTFLAGB_TCC1_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC1_Pos)) /* Assigment of value for TCC1 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TCC2_Pos                 _UINT32_(3)                                          /* (PAC_INTFLAGB) TCC2 Position */
#define PAC_INTFLAGB_TCC2_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TCC2_Pos)             /* (PAC_INTFLAGB) TCC2 Mask */
#define PAC_INTFLAGB_TCC2(value)              (PAC_INTFLAGB_TCC2_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC2_Pos)) /* Assigment of value for TCC2 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TCC3_Pos                 _UINT32_(4)                                          /* (PAC_INTFLAGB) TCC3 Position */
#define PAC_INTFLAGB_TCC3_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TCC3_Pos)             /* (PAC_INTFLAGB) TCC3 Mask */
#define PAC_INTFLAGB_TCC3(value)              (PAC_INTFLAGB_TCC3_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC3_Pos)) /* Assigment of value for TCC3 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TCC4_Pos                 _UINT32_(5)                                          /* (PAC_INTFLAGB) TCC4 Position */
#define PAC_INTFLAGB_TCC4_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TCC4_Pos)             /* (PAC_INTFLAGB) TCC4 Mask */
#define PAC_INTFLAGB_TCC4(value)              (PAC_INTFLAGB_TCC4_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC4_Pos)) /* Assigment of value for TCC4 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TCC5_Pos                 _UINT32_(6)                                          /* (PAC_INTFLAGB) TCC5 Position */
#define PAC_INTFLAGB_TCC5_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TCC5_Pos)             /* (PAC_INTFLAGB) TCC5 Mask */
#define PAC_INTFLAGB_TCC5(value)              (PAC_INTFLAGB_TCC5_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC5_Pos)) /* Assigment of value for TCC5 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TCC6_Pos                 _UINT32_(7)                                          /* (PAC_INTFLAGB) TCC6 Position */
#define PAC_INTFLAGB_TCC6_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TCC6_Pos)             /* (PAC_INTFLAGB) TCC6 Mask */
#define PAC_INTFLAGB_TCC6(value)              (PAC_INTFLAGB_TCC6_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC6_Pos)) /* Assigment of value for TCC6 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TCC7_Pos                 _UINT32_(8)                                          /* (PAC_INTFLAGB) TCC7 Position */
#define PAC_INTFLAGB_TCC7_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TCC7_Pos)             /* (PAC_INTFLAGB) TCC7 Mask */
#define PAC_INTFLAGB_TCC7(value)              (PAC_INTFLAGB_TCC7_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC7_Pos)) /* Assigment of value for TCC7 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TCC8_Pos                 _UINT32_(9)                                          /* (PAC_INTFLAGB) TCC8 Position */
#define PAC_INTFLAGB_TCC8_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TCC8_Pos)             /* (PAC_INTFLAGB) TCC8 Mask */
#define PAC_INTFLAGB_TCC8(value)              (PAC_INTFLAGB_TCC8_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC8_Pos)) /* Assigment of value for TCC8 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TCC9_Pos                 _UINT32_(10)                                         /* (PAC_INTFLAGB) TCC9 Position */
#define PAC_INTFLAGB_TCC9_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TCC9_Pos)             /* (PAC_INTFLAGB) TCC9 Mask */
#define PAC_INTFLAGB_TCC9(value)              (PAC_INTFLAGB_TCC9_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC9_Pos)) /* Assigment of value for TCC9 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_ADC_Pos                  _UINT32_(11)                                         /* (PAC_INTFLAGB) ADC Position */
#define PAC_INTFLAGB_ADC_Msk                  (_UINT32_(0x1) << PAC_INTFLAGB_ADC_Pos)              /* (PAC_INTFLAGB) ADC Mask */
#define PAC_INTFLAGB_ADC(value)               (PAC_INTFLAGB_ADC_Msk & (_UINT32_(value) << PAC_INTFLAGB_ADC_Pos)) /* Assigment of value for ADC in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_AC_Pos                   _UINT32_(12)                                         /* (PAC_INTFLAGB) AC Position */
#define PAC_INTFLAGB_AC_Msk                   (_UINT32_(0x1) << PAC_INTFLAGB_AC_Pos)               /* (PAC_INTFLAGB) AC Mask */
#define PAC_INTFLAGB_AC(value)                (PAC_INTFLAGB_AC_Msk & (_UINT32_(value) << PAC_INTFLAGB_AC_Pos)) /* Assigment of value for AC in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_PTC_Pos                  _UINT32_(13)                                         /* (PAC_INTFLAGB) PTC Position */
#define PAC_INTFLAGB_PTC_Msk                  (_UINT32_(0x1) << PAC_INTFLAGB_PTC_Pos)              /* (PAC_INTFLAGB) PTC Mask */
#define PAC_INTFLAGB_PTC(value)               (PAC_INTFLAGB_PTC_Msk & (_UINT32_(value) << PAC_INTFLAGB_PTC_Pos)) /* Assigment of value for PTC in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_SPI_IXS0_Pos             _UINT32_(14)                                         /* (PAC_INTFLAGB) SPI_IXS0 Position */
#define PAC_INTFLAGB_SPI_IXS0_Msk             (_UINT32_(0x1) << PAC_INTFLAGB_SPI_IXS0_Pos)         /* (PAC_INTFLAGB) SPI_IXS0 Mask */
#define PAC_INTFLAGB_SPI_IXS0(value)          (PAC_INTFLAGB_SPI_IXS0_Msk & (_UINT32_(value) << PAC_INTFLAGB_SPI_IXS0_Pos)) /* Assigment of value for SPI_IXS0 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_SPI_IXS1_Pos             _UINT32_(15)                                         /* (PAC_INTFLAGB) SPI_IXS1 Position */
#define PAC_INTFLAGB_SPI_IXS1_Msk             (_UINT32_(0x1) << PAC_INTFLAGB_SPI_IXS1_Pos)         /* (PAC_INTFLAGB) SPI_IXS1 Mask */
#define PAC_INTFLAGB_SPI_IXS1(value)          (PAC_INTFLAGB_SPI_IXS1_Msk & (_UINT32_(value) << PAC_INTFLAGB_SPI_IXS1_Pos)) /* Assigment of value for SPI_IXS1 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_CAN0_Pos                 _UINT32_(16)                                         /* (PAC_INTFLAGB) CAN0 Position */
#define PAC_INTFLAGB_CAN0_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_CAN0_Pos)             /* (PAC_INTFLAGB) CAN0 Mask */
#define PAC_INTFLAGB_CAN0(value)              (PAC_INTFLAGB_CAN0_Msk & (_UINT32_(value) << PAC_INTFLAGB_CAN0_Pos)) /* Assigment of value for CAN0 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_CAN1_Pos                 _UINT32_(17)                                         /* (PAC_INTFLAGB) CAN1 Position */
#define PAC_INTFLAGB_CAN1_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_CAN1_Pos)             /* (PAC_INTFLAGB) CAN1 Mask */
#define PAC_INTFLAGB_CAN1(value)              (PAC_INTFLAGB_CAN1_Msk & (_UINT32_(value) << PAC_INTFLAGB_CAN1_Pos)) /* Assigment of value for CAN1 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_CAN2_Pos                 _UINT32_(18)                                         /* (PAC_INTFLAGB) CAN2 Position */
#define PAC_INTFLAGB_CAN2_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_CAN2_Pos)             /* (PAC_INTFLAGB) CAN2 Mask */
#define PAC_INTFLAGB_CAN2(value)              (PAC_INTFLAGB_CAN2_Msk & (_UINT32_(value) << PAC_INTFLAGB_CAN2_Pos)) /* Assigment of value for CAN2 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_CAN3_Pos                 _UINT32_(19)                                         /* (PAC_INTFLAGB) CAN3 Position */
#define PAC_INTFLAGB_CAN3_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_CAN3_Pos)             /* (PAC_INTFLAGB) CAN3 Mask */
#define PAC_INTFLAGB_CAN3(value)              (PAC_INTFLAGB_CAN3_Msk & (_UINT32_(value) << PAC_INTFLAGB_CAN3_Pos)) /* Assigment of value for CAN3 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_CAN4_Pos                 _UINT32_(20)                                         /* (PAC_INTFLAGB) CAN4 Position */
#define PAC_INTFLAGB_CAN4_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_CAN4_Pos)             /* (PAC_INTFLAGB) CAN4 Mask */
#define PAC_INTFLAGB_CAN4(value)              (PAC_INTFLAGB_CAN4_Msk & (_UINT32_(value) << PAC_INTFLAGB_CAN4_Pos)) /* Assigment of value for CAN4 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_CAN5_Pos                 _UINT32_(21)                                         /* (PAC_INTFLAGB) CAN5 Position */
#define PAC_INTFLAGB_CAN5_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_CAN5_Pos)             /* (PAC_INTFLAGB) CAN5 Mask */
#define PAC_INTFLAGB_CAN5(value)              (PAC_INTFLAGB_CAN5_Msk & (_UINT32_(value) << PAC_INTFLAGB_CAN5_Pos)) /* Assigment of value for CAN5 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_ETH_Pos                  _UINT32_(24)                                         /* (PAC_INTFLAGB) ETH Position */
#define PAC_INTFLAGB_ETH_Msk                  (_UINT32_(0x1) << PAC_INTFLAGB_ETH_Pos)              /* (PAC_INTFLAGB) ETH Mask */
#define PAC_INTFLAGB_ETH(value)               (PAC_INTFLAGB_ETH_Msk & (_UINT32_(value) << PAC_INTFLAGB_ETH_Pos)) /* Assigment of value for ETH in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_TRNG_Pos                 _UINT32_(27)                                         /* (PAC_INTFLAGB) TRNG Position */
#define PAC_INTFLAGB_TRNG_Msk                 (_UINT32_(0x1) << PAC_INTFLAGB_TRNG_Pos)             /* (PAC_INTFLAGB) TRNG Mask */
#define PAC_INTFLAGB_TRNG(value)              (PAC_INTFLAGB_TRNG_Msk & (_UINT32_(value) << PAC_INTFLAGB_TRNG_Pos)) /* Assigment of value for TRNG in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_SDMMC0_Pos               _UINT32_(28)                                         /* (PAC_INTFLAGB) SDMMC0 Position */
#define PAC_INTFLAGB_SDMMC0_Msk               (_UINT32_(0x1) << PAC_INTFLAGB_SDMMC0_Pos)           /* (PAC_INTFLAGB) SDMMC0 Mask */
#define PAC_INTFLAGB_SDMMC0(value)            (PAC_INTFLAGB_SDMMC0_Msk & (_UINT32_(value) << PAC_INTFLAGB_SDMMC0_Pos)) /* Assigment of value for SDMMC0 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_SDMMC1_Pos               _UINT32_(29)                                         /* (PAC_INTFLAGB) SDMMC1 Position */
#define PAC_INTFLAGB_SDMMC1_Msk               (_UINT32_(0x1) << PAC_INTFLAGB_SDMMC1_Pos)           /* (PAC_INTFLAGB) SDMMC1 Mask */
#define PAC_INTFLAGB_SDMMC1(value)            (PAC_INTFLAGB_SDMMC1_Msk & (_UINT32_(value) << PAC_INTFLAGB_SDMMC1_Pos)) /* Assigment of value for SDMMC1 in the PAC_INTFLAGB register */
#define PAC_INTFLAGB_Msk                      _UINT32_(0x393FFFFF)                                 /* (PAC_INTFLAGB) Register Mask  */

#define PAC_INTFLAGB_SERCOM_Pos               _UINT32_(0)                                          /* (PAC_INTFLAGB Position) SERCOM9 */
#define PAC_INTFLAGB_SERCOM_Msk               (_UINT32_(0x1) << PAC_INTFLAGB_SERCOM_Pos)           /* (PAC_INTFLAGB Mask) SERCOM */
#define PAC_INTFLAGB_SERCOM(value)            (PAC_INTFLAGB_SERCOM_Msk & (_UINT32_(value) << PAC_INTFLAGB_SERCOM_Pos)) 
#define PAC_INTFLAGB_TCC_Pos                  _UINT32_(1)                                          /* (PAC_INTFLAGB Position) TCCx */
#define PAC_INTFLAGB_TCC_Msk                  (_UINT32_(0x3FF) << PAC_INTFLAGB_TCC_Pos)            /* (PAC_INTFLAGB Mask) TCC */
#define PAC_INTFLAGB_TCC(value)               (PAC_INTFLAGB_TCC_Msk & (_UINT32_(value) << PAC_INTFLAGB_TCC_Pos)) 
#define PAC_INTFLAGB_SPI_IXS_Pos              _UINT32_(14)                                         /* (PAC_INTFLAGB Position) SPI_IXSx */
#define PAC_INTFLAGB_SPI_IXS_Msk              (_UINT32_(0x3) << PAC_INTFLAGB_SPI_IXS_Pos)          /* (PAC_INTFLAGB Mask) SPI_IXS */
#define PAC_INTFLAGB_SPI_IXS(value)           (PAC_INTFLAGB_SPI_IXS_Msk & (_UINT32_(value) << PAC_INTFLAGB_SPI_IXS_Pos)) 
#define PAC_INTFLAGB_CAN_Pos                  _UINT32_(16)                                         /* (PAC_INTFLAGB Position) CANx */
#define PAC_INTFLAGB_CAN_Msk                  (_UINT32_(0x3F) << PAC_INTFLAGB_CAN_Pos)             /* (PAC_INTFLAGB Mask) CAN */
#define PAC_INTFLAGB_CAN(value)               (PAC_INTFLAGB_CAN_Msk & (_UINT32_(value) << PAC_INTFLAGB_CAN_Pos)) 
#define PAC_INTFLAGB_SDMMC_Pos                _UINT32_(28)                                         /* (PAC_INTFLAGB Position) SDMMCx */
#define PAC_INTFLAGB_SDMMC_Msk                (_UINT32_(0x3) << PAC_INTFLAGB_SDMMC_Pos)            /* (PAC_INTFLAGB Mask) SDMMC */
#define PAC_INTFLAGB_SDMMC(value)             (PAC_INTFLAGB_SDMMC_Msk & (_UINT32_(value) << PAC_INTFLAGB_SDMMC_Pos)) 

